# Chapter 6 Data Loading, Storage, and File Formats

## 6.1 Reading and Writing Data in Text Format

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
df = pd.read_csv('examples/ex1.csv')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [9]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names = ['a', 'b', 'c', 'd', 'message']

In [12]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [13]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [14]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [6]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [9]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [10]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [14]:
result = pd.read_csv('examples/ex5.csv')

In [15]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [17]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [18]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [20]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading Text Files in Pieces

In [3]:
pd.options.display.max_rows = 10

In [4]:
result = pd.read_csv('examples/ex6.csv')

In [5]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [6]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [8]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [9]:
chunker

In [10]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

<ipython-input-10-06f02b95c0dd>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [11]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [12]:
data = pd.read_csv('examples/ex5.csv')

In [13]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
data.to_csv('examples/out.csv')

In [15]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [16]:
import sys

In [17]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [18]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [19]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [4]:
dates = pd.date_range('1/1/2000', periods=7)

In [5]:
ts = pd.Series(np.arange(7), index=dates)

In [6]:
ts.to_csv('examples/tseries.csv')

In [7]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working with Delimited Formats

In [8]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [9]:
import csv

In [10]:
f = open('examples/ex7.csv')

In [11]:
reader = csv.reader(f)

In [12]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [13]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [14]:
header, values = lines[0], lines[1:]

In [15]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [16]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### JSON Data

In [12]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings":[{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
            {"name": "Katie", "age" : 38,
            "pets": ["Sixes", "Stache", "Cisco"]}]
}"""

In [3]:
import json

In [13]:
result = json.loads(obj)

In [14]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [15]:
asjson = json.dumps(result)

In [16]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [17]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [18]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [19]:
data = pd.read_json('examples/example.json')

In [20]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [21]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [22]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [24]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [25]:
len(tables)

1

In [27]:
failures = tables[0]

In [28]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [29]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [30]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

## 6.2 Binary Data Formats

In [37]:
frame = pd.read_csv('examples/ex1.csv')

In [38]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [39]:
frame.to_pickle('examples/frame_pickle')

In [40]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using HDF5 Format

In [43]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [44]:
store = pd.HDFStore('mydata.h5')

In [46]:
store['obj1'] = frame

In [47]:
store['obj1_col'] = frame['a']

In [48]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [49]:
store['obj1']

           a
0  -0.439389
1   1.332231
2  -0.919616
3  -0.618277
4   1.433976
..       ...
95  0.067687
96 -0.403914
97 -1.266311
98  1.333370
99  0.508446

[100 rows x 1 columns]

In [50]:
store.put('obj2', frame, format='table')

In [51]:
store.select('obj2', where=['index >= 10 and index <=15'])

           a
10 -0.395102
11  0.150991
12  0.647395
13  0.792631
14 -1.111962
15  1.167854

In [52]:
store.close()

In [53]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [54]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.439389
1  1.332231
2 -0.919616
3 -0.618277
4  1.433976

### Reading Microsoft Excel Files

In [55]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [56]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [58]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [59]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [60]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [61]:
frame.to_excel(writer, 'Sheet1')

In [62]:
writer.save()

In [64]:
frame.to_excel('examples/ex2.xlsx')

## 6.3 Interacting with Web APIs

In [65]:
import requests

In [66]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [67]:
resp = requests.get(url)

In [68]:
resp

In [70]:
data = resp.json()

In [71]:
data[0]['title']

'CLN: remove panel compat shim'

In [72]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [73]:
issues

,number,title,labels,state
0,37983,CLN: remove panel compat shim,[],open
1,37982,DEPR: how keyword in PeriodIndex.astype,[],open
2,37981,Deprecate inplace in Categorical.remove_catego...,[],open
3,37979,Should FilePathorBuffer use os.PathLike instea...,[],open
4,37977,BUG: CategoricalIndex.where nulling out non-ca...,[],open
5,37974,BUG: fix astype conversion string -> float,"[{'id': 1817503692, 'node_id': 'MDU6TGFiZWwxOD...",open
6,37972,TST: add nullable array frame constructor dtyp...,"[{'id': 1465286368, 'node_id': 'MDU6TGFiZWwxND...",open
7,37971,PERF: IntervalArray.argsort,[],open
8,37967,BUG: Limited available color name list when us...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
9,37966,Read csv headers,[],open
10,37965,BUG: Make DTI/TDI/PI argsort match their under...,[],open
11,37964,BUG: Bug in setitem raising ValueError when se...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
12,37963,"BUG: Some string methods treat ""."" as regex, o...","[{'id': 1741841389, 'node_id': 'MDU6TGFiZWwxNz...",open
13,37962,„case-when“ function is missing?,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
14,37958,BUG: DataFrame.to_html ignores formatters,[],open
15,37957,STYLE: fail on pd.testing direct usage,"[{'id': 106935113, 'node_id': 'MDU6TGFiZWwxMDY...",open
16,37956,"ENH: Add argument ""multiprocessing"" to DataFra...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
17,37955,"ENH: Add argument ""multiprocessing"" to pd.read...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
18,37954,BUG: df.__setitem__ can be 10x slower than pd....,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,37950,"ENH: 2D compat for DTA tz_localize, to_period","[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
20,37949,ENH: IntervalIndex as groups in groupby,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
21,37947,Slow autocompletion in python/ipython console ...,[],open
22,37941,ENH: An argument for .query() that returns all...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
23,37939,QST: how to run Pandas tests involving Numba o...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
24,37937,BUG: Concat automatically sorts index when axi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,37935,BUG: json_normalize() upcasts column with miss...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,37933,ENH: make closed part of IntervalDtype,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
27,37932,BUG: loc.setitem with expansion expanding rows,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
28,37931,BUG: loc.setitem corner case,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
29,37930,INT: include NA values in Categorical.categories,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open

## 6.4 Interacting with Databases

In [74]:
import sqlite3

In [76]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""

In [77]:
con = sqlite3.connect('mydata.sqlite')

In [78]:
con.execute(query)

In [79]:
con.commit()

In [80]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacremento', 'California', 1.7, 5)]

In [81]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [82]:
con.executemany(stmt, data)

In [83]:
con.commit()

In [84]:
cursor = con.execute('select * from test')

In [85]:
rows = cursor.fetchall()

In [86]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacremento', 'California', 1.7, 5)]

In [87]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [88]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacremento  California  1.70  5

In [89]:
import sqlalchemy as sqla

In [90]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [ ]:
pd.read_sql('select * from te')